# RebarSystemSpacingBackDirn1 Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RebarSystemSpacingBackDirn1 Property
ParameterTypeId Class See Also
---
"Interior Major Spacing"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RebarSystemSpacingBackDirn1 { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RebarSystemSpacingBackDirn1 As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RebarSystemSpacingBackDirn1 {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace